Библиотека/src/DataProcessors/ИмпортСправочникаКнигИзExcel/ИмпортСправочникаКнигИзExcel.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИмпортСправочникаКнигИзExcel</name>
</mdclass:DataProcessor>

Библиотека/src/Catalogs/Книги/Книги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Книги</name>
  <attributes>
    <name>Страниц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издательство</name>
    <type>
      <types>CatalogRef.Издательства</types>
    </type>
  </attributes>
  <attributes>
    <name>ISBN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяКомпактДиск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ББК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УДК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Диск</name>
    <type>
      <types>CatalogRef.Диски</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодИздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тираж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обложка</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Авторы</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Авторы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Библиотека/src/DataProcessors/ИмпортСправочникаКнигИзExcel/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Таблица Excel(*.xls)|*.xls|Таблица Excel 2007(*.xlsx)|*.xlsx|CSV файл(*.csv)|*.csv|Все файлы(*.*)|*.*";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru = 'Выберите файл'");
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортСправочникаКниг(Команда)
	НачальнаяСтрока = 2;
	xlLastCell = 11;
	НомерЛистаExcel=1;
	ВыбФайл = Новый Файл(ПутьКФайлу);
	Если НЕ ВыбФайл.Существует() Тогда
		Сообщить(НСтр("ru = 'Файл не существует.'"));
		Возврат;
	КонецЕсли;
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ПутьКФайлу);
		Сообщить(НСтр("ru = 'Обработка файла Microsoft Excel...'"));
		ExcelЛист = Excel.Sheets(НомерЛистаExcel);
	Исключение
		Сообщить(НСтр("ru = 'Ошибка. Возможно неверно указан номер листа книги Excel.'"));
		Возврат;
	КонецПопытки;
	ActiveCell = Excel.ActiveCell.SpecialCells(xlLastCell);
	RowCount = ActiveCell.Row;
	// Сформируем массив книг что бы передать на обработку в сервер один раз
	МассивКниг = Новый Массив;
	Для Row = НачальнаяСтрока По RowCount Цикл
		Column = 2; //Инвентарный номер
		ИнвентарныйНомер = СокрЛП(ExcelЛист.Cells(Row,Column).Value);
		Column = 3; //Наименование
		Наименование = СокрЛП(ExcelЛист.Cells(Row,Column).Value);
		Column = 4; //Страниц
		Страниц = СокрЛП(ExcelЛист.Cells(Row,Column).Value);
		Column = 5; //Издательство
		Издательство = СокрЛП(ExcelЛист.Cells(Row,Column).Value);
		Column = 6; //Авторы
		Авторы = СокрЛП(ExcelЛист.Cells(Row,Column).Value);
		Column = 7; //Описание
		Описание = СокрЛП(ExcelЛист.Cells(Row,Column).Value);
		Column = 8; //ISBN
		ISBN = СокрЛП(ExcelЛист.Cells(Row,Column).Value);
		Column = 9; //ББК
		ББК = СокрЛП(ExcelЛист.Cells(Row,Column).Value);
		Попытка
			Страниц = Число(Страниц);
		Исключение
		КонецПопытки;
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ИнвентарныйНомер",ИнвентарныйНомер);
		СтруктураДанных.Вставить("Наименование",Наименование);
		СтруктураДанных.Вставить("Страниц",Страниц);
		СтруктураДанных.Вставить("Издательство",Издательство);
		СтруктураДанных.Вставить("Описание",Описание);
		СтруктураДанных.Вставить("ISBN",ISBN);
		СтруктураДанных.Вставить("ББК",ББК);
		МассивКниг.Добавить(СтруктураДанных);
	КонецЦикла;
	// Закрываем Excel что бы не висел процесс и не блокировал файл
	Excel.Quit();
	Excel = Неопределено;	
	ExcelЛист = Неопределено;
	Сообщить(НСтр("ru = 'Завершение чтения. Закрытие Excel.'"));
	// Создадим элементы на сервере
	СоздатьСправочникКниги(МассивКниг);
КонецПроцедуры

&НаСервере
Процедура СоздатьСправочникКниги(МассивКниг)
	
	Для Каждого СтруктураДанных Из МассивКниг Цикл
		
		Издательство = Неопределено;
		Если ЗначениеЗаполнено(СтруктураДанных.Издательство) Тогда
			Издательство = Справочники.Издательства.НайтиПоНаименованию(СтруктураДанных.Издательство, Истина);
			Если Издательство = Справочники.Издательства.ПустаяСсылка() Тогда
				Издательство = Справочники.Издательства.СоздатьИздательство(СтруктураДанных.Издательство);
			КонецЕсли;
		КонецЕсли;
		
		Справочники.Книги.СоздатьКнигу(
			СтруктураДанных.Наименование,
			СтруктураДанных.Наименование,
			СтруктураДанных.Описание,
			Новый Массив(),
			Издательство,
			СтруктураДанных.Страниц,
			0,
			СтруктураДанных.ИнвентарныйНомер,
			СтруктураДанных.ISBN,
			СтруктураДанных.ББК,
			"",
			Неопределено);
			
		КонецЦикла;
		
	Сообщить(НСтр("ru = 'Импорт справочников завершен.'"));
	
КонецПроцедуры;
